<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Perl Critic.</string>
	<key>Identifier</key>
	<string>SPSC.download.PerlCritic</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>PerlCritic</string>
		<key>NAME</key>
		<string>Perl Critic</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://pre-platform-installers.s3.amazonaws.com/ActivePerl-5.28.1.2801-darwin-13.4.0-bbb7e70b7d.pkg?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAQ5FYQM547I2EFPRW%2F20220815%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20220815T180513Z&amp;X-Amz-Expires=21600&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Signature=bbfd6817e39bfa82195852982cac7ebb297b078d58b98b1e47fc30a7a5274fb5</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: ActiveState Software Inc. (6L3MMJ36R9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
