<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Chrome and creates a package.</string>
	<key>Identifier</key>
	<string>SPSC.pkg.Chrome</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>R</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<string>true</string>
	</dict>
    <key>ParentRecipe</key>
	<string>SPSC.download.Chrome</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
